Revit 2026 API

# ITransactionFinalizer Interface

---

An interface that may be used to perform a custom action at the end of a transaction. A method of the interface will be called when a transaction is either committed or rolled back.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ITransactionFinalizer
```
```vb
Public Interface ITransactionFinalizer
```
```cpp
public interface class ITransactionFinalizer
```
```fsharp
type ITransactionFinalizer = interface end
```

The ITransactionFinalizer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnCommitted | This method is called at the end of committing a transaction |
|  | OnRolledBack | This method is called at the end of rolling back a transaction |

#### Reference

Autodesk.Revit.DB Namespace